#!bin/bas

# Назва скрипта: [Привітання та інформація про користувача]
 
# Автор: [Андрющенко Мар'яна]
 
# Опис: [Скрипт вітає користувача, запитує його ім'я та вік, показує інформацію про поточну дату та час, показує поточну директорію, рахує кількість файлів в поточній папці]

echo "=== Привітання ==="
read -p "Як вас звати? " name
read -p "Скільки вам років? " age
echo "Привіт, $name! Вам $age років."
echo "Сьогодні: $(date +"%d.%m.%Y %H:%M:%S")"
echo "Поточна папка: $PWD"
FILES=$(ls | wc -l)
echo "Файлів в папці: $FILES"
